#include <stdio.h>
#include <conio.h>
#include <locale.h>
int m, n, nx;
int x[100];
int* y;

void put(int i, int j, unsigned short int c)
{
    if (c == x[0]) //если не равен разреженному эелменты
        return;
    int k = j * n + i; //индекс в одномерном
    int t = 1;
    int kx =0;//кол-во шагов в массиве
    while ((t < nx) && (x[t] < k))
    {
        t += 2;
        kx++;
    };
    if ((t >= nx) || //добавить в конец
        (kx == 0) ||//добавить в начало
        ((kx > 0) && (t < nx) && (x[t] == k) && (x[t + 1] != c))) //элемент найден
        // но значение другое
    {
        //добавить элемент
        nx += 2;
        x[t] = k;
        x[t + 1] = c;
    }
}
char get(int i, int j)
{
    int k = j * n + i; //индекс в одномерном
    int  t = 1;
    int kx=0;
    while ((t < nx) && (x[t] < k))
    {
        t += 2;
        kx++;
    };
    if ((t > nx) || ((kx == 0) && (x[t] != k)))
        return(x[0]); //вернуть разреженный элемент
    else
        if (x[t] == k)
            return (x[t + 1]); //элементт найден
        else return (x[0]);  //элемент <нулевой> ,почему определило нулевой элемент как чисо 0, хот€ //например мы присваивали x[0]=5
}
void main(void)
{
    setlocale(LC_ALL, "Rus");
    int i, j, a;
    nx = 1;
    for (i = 0; i < 100; i++)
        x[i] = 0;
    x[0] = 0;//элемент, который будет преобладать
    printf("¬ведите количество строк матрицы m: ");
    scanf("%d", &m); //ввод количество строк
    printf("¬ведите количество столбцов матрицы n : ");
    scanf("%d", &n); //количество столбцов
    printf("¬ведите элементы матрицы : \n");
    for (j = 0; j < m; j++)
    {
        for (i = 0; i < n; i++) //ввод элементов строки 
        {
            if (((i + 1) % 2==0) || ((j + 1) % 2==0)) //если индекс четный, то
            a = 0; //элемент равен нулю
            else //иначе
            {
                printf("¬ведите элемент (%d, %d): ", i + 1, j + 1);
                scanf("%d", &a);
            }
            put(i, j, a); //вызов функции сохранени€ элемента
        }
    }
    printf("»сходна€ матрица:\n");
    for (j = 0; j <= m - 1; j++)
    {
        for (i = 0; i <= n - 1; i++)
        {
            a = get(i, j); //вернуть элемент
            
            printf("%3d", a); //вывести на экран
        }
        printf("\n"); //пернести строку
    }
    getch();
}


	
	

